["Kephart, J.O., Chess, D.M.: The vision of autonomic computing. IEEE Computer 36(1), 41–50 (2003)CrossRefGoogle Scholar","Alonso, G., Casati, F., Kuno, H., Machiraju, V.: WebServices: Concepts, Architectures, Applications. Springer, Heidelberg (2004)MATHGoogle Scholar","Fielding, R.T.: Architectural Styles and the Design of Network-based Software Architectures, Doctoral dissertation, University of California, Irvine (2000)","Kiczales, G., Lamping, J., Mendhekar, A.: Aspect-oriented programming. In: Aksit, M., Auletta, V. (eds.) ECOOP 1997. LNCS, vol. 1241, pp. 220–242. Springer, Heidelberg (1997)CrossRefGoogle Scholar","Cibrán, M.A., Verheecke, B.: Modularizing Web Services Management with AOP. In: Cardelli, L. (ed.) ECOOP 2003. LNCS, vol. 2743. Springer, Heidelberg (2003)Google Scholar","Charfi, A., Schmeling, B., Heizenreder, A., Mezini, M.: Reliable, Secure and Transacted Web Service Compositions with AO4BPEL. In: Proceedings of the 2nd International Conference on Service Oriented Computing, ICSOC 2004, New-York, USA (2004)","Kongdenfha, W., Saint-Paul, R., Benatallah, B., Casati, F.: An Aspect-Oriented Framework for Service Adaptation. In: Dan, A., Lamersdorf, W. (eds.) ICSOC 2006. LNCS, vol. 4294, pp. 15–26. Springer, Heidelberg (2006)CrossRefGoogle Scholar","Haas, H.: Reconciling Web services and REST services (Keynote Address). In: Proc. of the 3rd IEEE Europe Conference on Web Services (ECOWS 2005), Växjö, Sweden (November 2005)","zur Muehlen, M., Nickerson, J.V., Swenson, K.D.: Developing Web services choreography standards - the case of REST vs. SOAP. Decision Support Systems 40(1), 9–29 (2005)CrossRefGoogle Scholar","Laskey, K., Hègaret, P.L., Newcomer, E. (eds.): Workshop on Web of Services for Enterprise Computing. W3C (February 2007)","Richardson, L., Ruby, S.: RESTful Web Services. O’Reilly, Sebastopol (2007)Google Scholar","Fielding, R.T., Taylor, R.N.: Principled Design of the Modern Web Architecture. ACM Transactions on Internet Technology (TOIT) (New York: Association for Computing Machinery) (2005)","Pautasso, C., Zimmermann, O., Leymann, F.: RESTful Web Services vs. Big Web Services: Making the Right Architectural Decision. In: 17th International World Wide Web Conference (WWW 2008), Beijing, China (2008)","Berners-Lee, T., Fielding, R., Masinter, L.: Uniform Resource Identifier (URI): generic syntax. IETF RFC 3986 (January 2005)","Laddad, R.: AspectJ in Action. Manning Publications Co., Greenwich (2003)Google Scholar","Avgustinov, P., Christensen, A.S., Hendren, L., Kuzins, S., Lhoták, J., Lhoták, O., de Moor, O.: An Extensible AspectJ Compiler. In: Proceedings of the 4th International Conference on Aspect-Oriented Software Development, pp. 87–98. ACM Digital Library (2005)","Snell, J.: Resource-oriented vs. activity-oriented Web services. IBM Developer Works (October 2004)","Landre, E., Wesenberg, H.: Rest versus soap: as architectural style for web services. In: 5th International OOPSLA Workshop on SOA & Web Services Best Practices (2007)","Zarras, A.: A comparison for middleware infrastructures. Journal of Object Technology 3(5), 103–123 (2004)CrossRefGoogle Scholar","Zimmermann, O., Grundler, J., Tai, S., Leymann, F.: Architectural decisions and patterns for transactional worlflows in SOA. In: Krämer, B.J., Lin, K.-J., Narasimhan, P. (eds.) ICSOC 2007. LNCS, vol. 4749, pp. 81–93. Springer, Heidelberg (2007)CrossRefGoogle Scholar"]