["Armbrust, M., Stoica, I., Zaharia, M., Fox, A., Griffith, R., Joseph, A.D., Katz, R., Konwinski, A., Lee, G., Patterson, D., Rabkin, A.: A view of cloud computing. Commun. ACM 53(4), 50 (2010). http://portal.acm.org/citation.cfm?doid=1721654.1721672\n        CrossRefGoogle Scholar","Rodríguez, C., Baez, M., Daniel, F., Casati, F., Trabucco, J.C., Canali, L., Percannella, G.: REST APIs: a large-scale analysis of compliance with principles and best practices. In: Bozzon, A., Cudré-Mauroux, P., Pautasso, C. (eds.) ICWE 2016. LNCS, vol. 9671, pp. 21–39. Springer, Heidelberg (2016). doi:10.1007/978-3-319-38791-8_2\n        CrossRefGoogle Scholar","Ciuffoletti, A.: Application level interface for a cloud monitoring service. Comput. Stand. Interfaces 46, 15–22 (2016). http://www.sciencedirect.com/science/article/pii/S0920548916000027\n        CrossRefGoogle Scholar","Fielding, R.T.: Architectural styles and the design of network-based software architectures. Ph.D. thesis, University of California, Irvine (2000). http://www.ics.uci.edu/ fielding/pubs/dissertation/top.htm\n        ","Maleshkova, M., Pedrinaci, C., Domingue, J.: Investigating web APIs on the world wide web. In: 2010 Eighth IEEE European Conference on Web Services, pp. 107–114. IEEE (2010). http://ieeexplore.ieee.org/lpdocs/epic03/wrapper.htm?arnumber=5693251\n        ","Masse, M.: REST API Design Rulebook, vol. 53. O’Reilly Media, Sebastopol (2011)Google Scholar","Merle, P., Barais, O., Parpaillon, J., Plouzeau, N., Tata, S.: A precise metamodel for open cloud computing interface. In: 2015 IEEE 8th International Conference on Cloud Computing, pp. 852–859, June 2015","Palma, F., Dubois, J., Moha, N.: Service-Oriented Computing. Lecture Notes in Computer Science, vol. 8831. Springer, Berlin, Heidelberg (2014). http://link.springer.com/10.1007/978-3-662-45391-9\n        CrossRefGoogle Scholar","Palma, F., Gonzalez-Huerta, J., Moha, N., Guéhéneuc, Y.G., Tremblay, G.: Are RESTful APIs well-designed? Detection of their linguistic (anti)patterns. In: Toumani, F., et al. (eds.) ICSOC 2014. LNCS, vol. 8954. Springer, Heidelberg (2015). http://link.springer.com/10.1007/978-3-319-22885-3, http://link.springer.com/10.1007/978-3-662-48616-0_11\n        Google Scholar","Paraiso, F., Challita, S., Al-Dhuraibi, Y., Merle, P.: Model-driven management of docker containers. In: Proceedings of 9th IEEE International Conference on Cloud Computing (CLOUD) (2016, to appear)","Richardson, L., Ruby, S.: RESTful Web Services. O’Reilly Media Inc., Sebastopol (2007)Google Scholar","Stowe, M.: Undisturbed REST: A Guide to Designing the Perfect API. MuleSoft, San Francisco (2015)Google Scholar","Vinoski, S.: RESTful web services development checklist. IEEE Internet Comput. 12(6), 95–96 (2008). http://ieeexplore.ieee.org/lpdocs/epic03/wrapper.htm?arnumber=4670126\n        CrossRefGoogle Scholar","Zhang, C., Budgen, D.: What do we know about the effectiveness of software design patterns? IEEE Trans. Softw. Eng. 38(5), 1213–1231 (2012)CrossRefGoogle Scholar","Zhang, Q., Cheng, L., Boutaba, R.: Cloud computing: state-of-the-art and research challenges. J. Internet Serv. Appl. 1(1), 7–18 (2010). http://www.springerlink.com/index/10.1007/s13174-010-0007-6\n        CrossRefGoogle Scholar","Zhou, W., Li, L., Luo, M., Chou, W.: REST API design patterns for SDN northbound API. In: 2014 28th International Conference on Advanced Information Networking and Applications Workshops, pp. 358–365. IEEE (2014). http://ieeexplore.ieee.org/lpdocs/epic03/wrapper.htm?arnumber=6844664\n        "]