["Fielding, R.: Architectural Styles and The Design of Network-based Software Architectures. PhD thesis, University of California, Irvine (2000)","Vinoski, S.: Serendipitous reuse. IEEE Internet Computing 12(1), 84–87 (2008)CrossRefGoogle Scholar","O’Reilly, T.: REST vs. SOAP at Amazon (April (2003), http://www.oreillynet.com/pub/wlg/3005\n                ","Programmable Web: API Dashboard (2007), http://www.programmableweb.com/apis\n                ","Fielding, R.: A little REST and Relaxation. The International Conference on Java Technology (JAZOON07), Zurich, Switzerland (June 2007), http://www.parleys.com/display/PARLEYS/A%20little%20REST%20and%20Relaxation\n                ","Richardson, L., Ruby, S.: RESTful Web Services. O’Reilly, Sebastopol (2007)Google Scholar","Laskey, K., Hgaret, P.L., Newcomer, E., (eds.): Workshop on Web of Services for Enterprise Computing, W3C (February 2007), http://www.w3.org/2007/01/wos-ec-program.html\n                ","Berners-Lee, T., Fielding, R., Masinter, L.: Uniform Resource Identifier (URI): generic syntax. IETF RFC 3986 (January 2005)","Florescu, D., Gruenhagen, A., Kossmann, D.: XL: An XML programming language for Web service specification and composition. In: Proc. of the 11th International World Wide Web Conference (WWW 2002), Honululu, Hawaii, USA (May 2002)","Crockford, D.: JSON: The fat-free alternative to XML. In: Proc. of XML 2006, Boston, USA (December 2006), http://www.json.org/fatfree.html\n                ","Pautasso, C., Zimmermann, O., Leymann, F.: RESTful Web Services vs. Big Web Services: Making the right architectural decision. In: Proc. of the 17th World Wide Web Conference, Beijing, China (April 2008)","Haas, H.: Reconciling Web services and REST services. In: Proc. of ECOWS 2005, Växjö, Sweden, Keynote Address (November 2005)","OASIS: Web Services Business Process Execution Language (WSBPEL) 2.0 (2006)","Assmann, U.: Invasive Software Composition. Springer, Heidelberg (2003)MATHGoogle Scholar","IBM, SAP: WS-BPEL Extension for Sub-Processes (October 2005)","Active Endpoints, IBM, Oracle, SAP: WS-BPEL Extension for People (August 2005)","Tan, W., Fong, L., Bobroff, N.: BPEL4JOB: A fault-handling design for job flow management. In: Krämer, B.J., Lin, K.-J., Narasimhan, P. (eds.) ICSOC 2007. LNCS, vol. 4749, pp. 27–42. Springer, Heidelberg (2007)CrossRefGoogle Scholar","Habich, D., Richly, S., Preissler, S., Grasselt, M., Lehner, W., Maier, A.: BPEL-DT - data-aware extension of BPEL to support data-intensive service applications. In: Emerging Web Services Technology, vol. II. Birkhäuser, Basel (September 2008)Google Scholar","Nitzsche, J., van Lessen, T., Karastoyanova, D., Leymann, F.: BPELlight. In: Alonso, G., Dadam, P., Rosemann, M. (eds.) BPM 2007. LNCS, vol. 4714, pp. 214–229. Springer, Heidelberg (2007)CrossRefGoogle Scholar","Chinthaka, E.: REST and Web services in WSDL 2.0 (May (2007), http://www.ibm.com/developerworks/webservices/library/ws-rest1/\n                ","Pasley, J.: Using Yahoo’s REST services with BPEL. Cape Clear (2008), http://developer.capeclear.com/video/httpwizard/httpwizard.html\n                ","Snell, J.: Resource-oriented vs. activity-oriented Web services. IBM developerWorks (October 2004), http://www-128.ibm.com/developerworks/webservices/library/ws-restvsoap/\n                ","Vinoski, S.: Putting the ”Web” into Web services: Interaction models, part 1: Current practice. IEEE Internet Computing 6(3), 89–91 (2002)CrossRefGoogle Scholar","Vinoski, S.: Putting the ”Web” into Web services: Interaction models, part 2. IEEE Internet Computing 6(4), 90–92 (2002)CrossRefGoogle Scholar","Wikipedia: Mashup (web application hybrid), http://en.wikipedia.org/wiki/Mashup_web_application_hybrid\n                ","Maximilien, M., Nielsen, D., Tai, S. (eds.): 1st International Workshop on Web APIs and Services Mashups (September 2007)","Schrenk, M.: Webbots, Spiders, and Screen Scrapers. No Starch Press (2007)","Hadley, M.J.: Web Application Description Language (WADL) (2006), http://wadl.dev.java.net/\n                ","Barros, A., Dumas, M., ter Hofstede, A.H.: Service interaction patterns. In: Proc. of the 3rd International Conference on Business Process Management. LNCS, vol. 3694. Springer, Heidelberg (2005)Google Scholar","Overdick, H.: Towards resource-oriented BPEL. In: 2nd ECOWS Workshop on Emerging Web Services Technology (November 2007)","Curbera, F., Duftler, M., Khalaf, R., Lovell, D.: Bite: Workflow composition for the web. In: Krämer, B.J., Lin, K.-J., Narasimhan, P. (eds.) ICSOC 2007. LNCS, vol. 4749, pp. 94–106. Springer, Heidelberg (2007)CrossRefGoogle Scholar","Dustdar, S., Schreiner, W.: A survey on web services composition. International Journal of Web and Grid Services (IJWGS) 1(1), 1–30 (2005)CrossRefGoogle Scholar","Pautasso, C., Alonso, G.: From Web Service Composition to Megaprogramming. In: Shan, M.-C., Dayal, U., Hsu, M. (eds.) TES 2004. LNCS, vol. 3324, pp. 39–53. Springer, Heidelberg (2005)Google Scholar","zur Muehlen, M., Nickerson, J.V., Swenson, K.D.: Developing web services choreography standards - the case of REST vs. SOAP. Decision Support Systems 40(1), 9–29 (2005)CrossRefGoogle Scholar"]