["F# data: Json type provider. http://fsharp.github.io/FSharp.Data/library/JsonProvider.html\n        ","Betten, S.: Richardson maturity model. Technical report, Fachgebiet Software Engineering, Universität Hannover (2011)","Cánovas Izquierdo, J.L., Cabot, J.: Discovering implicit schemas in JSON data. In: Daniel, F., Dolog, P., Li, Q. (eds.) ICWE 2013. LNCS, vol. 7977, pp. 68–83. Springer, Heidelberg (2013)CrossRefGoogle Scholar","Eclipse.org: Xtend. http://www.eclipse.org/xtend/\n        ","Ed-Douibi, H., Izquierdo, J.L.C., Gómez, A., Tisi, M., Cabot, J.: EMF-REST: generation of restful apis from models. CoRR (2015)","Efftinge, S.: Jsonized. http://github.com/svenefftinge/jsonized\n        ","FasterXML: Jackson json processor wiki. http://wiki.fasterxml.com/JacksonHome\n        ","Fielding, R.T.: Architectural Styles and the Design of Network-based Software Architectures. Ph.D. thesis (2000)","Fowler, M.: Domain Specific Languages, 1st edn. Addison-Wesley Professional, Boston (2010)Google Scholar","Gerhart, M., Bayer, J., Höfner, J.M., Boger, M.: Approach to define highly scalable metamodels based on JSON. In: BigMDE 2015, p. 11 (2015)","Izquierdo, J.L.C., Cabot, J.: Composing JSON-based web APIs. In: Casteleyn, S., Rossi, G., Winckler, M. (eds.) ICWE 2014. LNCS, vol. 8541, pp. 390–399. Springer, Heidelberg (2014)Google Scholar","Maximilien, E.M., Wilkinson, H., Desai, N., Tai, S.: A domain-specific language for web APIs and services mashups. In: Krämer, B.J., Lin, K.-J., Narasimhan, P. (eds.) ICSOC 2007. LNCS, vol. 4749, pp. 13–26. Springer, Heidelberg (2007)CrossRefGoogle Scholar","Menkudle, A., Sonawane, S., Jagtap, A.: Extracting application model from restful web services for client stub generation. Int. J. Comput. Technol. Appl. (IJCTA) 5(1), 226–232 (2014)Google Scholar","Rivero, J.M., Heil, S., Grigera, J., Gaedke, M., Rossi, G.: MockAPI: an agile approach supporting API-first web application development. In: Daniel, F., Dolog, P., Li, Q. (eds.) ICWE 2013. LNCS, vol. 7977, pp. 7–21. Springer, Heidelberg (2013)CrossRefGoogle Scholar","Scheidgen, M.: XRAW-Easy development of REST API client libraries with Xtend. http://github.com/markus1978/xraw\n        ","Sheard, T.: Accomplishments and research challenges in meta-programming. In: Taha, W. (ed.) SAIG 2001. LNCS, vol. 2196, pp. 2–44. Springer, Heidelberg (2001)CrossRefGoogle Scholar","Tavares, N., Vale, S., Luis, S., Brazil, M.: Towards interoperability to the implementation of RESTful web services: a model driven approach. In: International Conference on Systems (ICONS), pp. 234–240 (2014)","Tilkov, S.: REST und HTTP: Einsatz der Architektur des Web für Integrationsszenarien. dpunkt, Heidelberg (2009)"]