["Agha, G., Thati, P., Ziaei, R.: Actors: A Model For Reasong About Open Distributed Systems. Formal Methods for Distributed Processing - An Object Oriented Approach, ch. 8. Cambridge University Press, Cambridge (2001)Google Scholar","Agha, G., Varela, C.A.: Worldwide computing middleware. In: Singh, M. (ed.) Practical Handbook on Internet Computing. CRC Press, Boca Raton (2004) (invited book chapter)Google Scholar","Agha, G.A.: Actors: A model of concurrent computation in distributed systems. Technical Report 844, MIT Artifical Intelligence Laboratory (June 1985)","Armstrong, J.: Programming Erlang: Software for a Concurrent World. The Pragmatic Bookshelf (June 2007)","Böhm, A., Kanne, C.-C.: Processes Are Data: A Programming Model for Distributed Applications. In: Vossen, G., Long, D.D.E., Yu, J.X. (eds.) WISE 2009. LNCS, vol. 5802, pp. 53–56. Springer, Heidelberg (2009)CrossRefGoogle Scholar","Chang, P.H., Agha, G.: Supporting reconfigurable object distribution for customized web applications. In: The 22nd Annual ACM Symposium on Applied Computing, SAC (2007)","Erenkrantz, J.R., Gorlick, M., Suryanarayana, G., Taylor, R.N.: From representations to computations: the evolution of web architectures. In: ESEC-FSE ’07: Proceedings of the the 6th Joint Meeting of the European Software Engineering Conference and the ACM SIGSOFT Symposium on The foundations of Software Engineering, pp. 255–264. ACM, New York (2007)Google Scholar","Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P., Berners-Lee, T.: Hypertext Transfer Protocol – HTTP/1.1. RFC 2616 (Draft Standard) (June 1999), updated by RFC 2817 http://www.ietf.org/rfc/rfc2616.txt\n                ","Fielding, R.T.: Architectural Styles and the Design of Network-based Software Architectures. Ph.D. thesis, University of California, Irvine (2000)","Hewitt, C.: Viewing control structures as patterns of passing messages. A.I. Memo 410, MIT Artifical Intelligence Laboratory (December 1976)","Hewitt, C., Bishop, P., Steiger, R.: A universal modular actor formalism for artificial intelligence. In: IJCAI’73: Proceedings of the 3rd International Joint Conference on Artificial Intelligence, pp. 235–245. Morgan Kaufmann Publishers Inc, San Francisco (1973)Google Scholar","Laitkorpi, M., Koskinen, J., Systa, T.: A uml-based approach for abstracting application interfaces to rest-like services. In: WCRE ’06: Proceedings of the 13th Working Conference on Reverse Engineering, pp. 134–146. IEEE Computer Society Press, Washington (2006)Google Scholar","Laitkorpi, M., Selonen, P., Systa, T.: Towards a model-driven process for designing restful web services. In: ICWS ’09: Proceedings of the 2009 IEEE International Conference on Web Services, pp. 173–180. IEEE Computer Society Press, Washington (2009)CrossRefGoogle Scholar","Pautasso, C., Zimmermann, O., Leymann, F.: Restful web services vs. “big” web services: making the right architectural decision. In: WWW ’08: Proceeding of the 17th International Conference on World Wide Web, pp. 805–814. ACM, New York (2008)CrossRefGoogle Scholar","Razavi, A., Marinos, A., Moschoyiannis, S., Krause, P.: RESTful Transactions Supported by the Isolation Theorems. In: Gaedke, M., Grissnikalus, M., Diaz, O. (eds.) ICWE 2009. LNCS, vol. 5648, pp. 394–409. Springer, Heidelberg (2009)Google Scholar","Richardson, L., Ruby, S.: RESTful Web Services. O’Reilly, Sebastopol (2007)Google Scholar","Theriault, D.G.: Issues in the design and implementation of act2. Technical Report 728, MIT Artifical Intelligence Laboratory (June 1983)","Varela, C.: Worldwide Computing with Universal Actors: Linguistic Abstractions for Naming, Migration, and Coordination. Ph.D. thesis, U. of Illinois at Urbana-Champaign (2001)","Varela, C.A., Agha, G.: Programming dynamically reconfigurable open systems with SALSA. In: ACM SIG-PLAN Notices. OOPSLA’2001 Intriguing Technology Track Proceedings, vol. 36(12), pp. 20–34 (December 2001)","Weerawarana, S., Curbera, F., Leymann, F., Storey, T., Ferguson, D.F.: Web Services Platform Architecture: SOAP, WSDL, WS-Policy, WS-Addressing, WS-BPEL, WS-Reliable Messaging and More. Prentice Hall PTR, Upper Saddle River (2005)Google Scholar"]