["Apache Software Foundation: Apache HttpComponents (2011), http://hc.apache.org/\n                ","Avizienis, A., Laprie, J.C., Randell, B., Landwehr, C.: Basic concepts and taxonomy of dependable and secure computing. IEEE Transactions on Dependable and Secure Computing 1(1), 11–33 (2004)CrossRefGoogle Scholar","Cardellini, V., Casalicchio, E.: The state of the art in locally distributed web-server systems. ACM Computing Surveys 34(2), 263–311 (2002)CrossRefGoogle Scholar","Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P., Berners-Lee, T.: Hypertext Transfer Protocol – HTTP/1.1 (June 1999)","Fielding, R.T.: Architectural Styles and the Design of Network-based Software Architectures. Ph.D. thesis, University of California, Irvine (2000)","Gilbert, S., Lynch, N.: Brewer’s conjecture and the feasibility of consistent, available, partition-tolerant web services. SIGACT News 33(2), 51–59 (2002)CrossRefGoogle Scholar","Gregorio, J.: RESTify daytrader (2007), http://bitworking.org/news/201/RESTify-DayTrader\n                ","Gudgin, M., Hadley, M., Mendelsohn, N., Moreau, J.J., Nielsen, H.F., Karmarkar, A., Lafon, Y.: SOAP Version 1.2 Part 1: Messaging Framework. W3C (April 2007), http://www.w3.org/TR/soap12-part1/\n                ","Hitchens, R.: Java NIO. O’Reilly, Beijing (2002)Google Scholar","IT-SOA Research Network: MProxy — modular proxy server (2011), http://www.it-soa.eu/mproxy/\n                ","JGroups: A Toolkit for Reliable Multicast Communication (2009), http://www.jgroups.org\n                ","OSGi Alliance: OSGi Service Platform, Release 3. IOS Press, Inc. (2003)","Pautasso, C., Zimmermann, O., Leymann, F.: RESTful web services vs. “Big” Web Services: making the right architectural decision. In: Proc. of the 17th Int. Conf. on World Wide Web, Beijing, China, pp. 805–814 (2008)","Richardson, L., Ruby, S.: RESTful Web Services. O’Reilly Media (2007)","Saito, Y., Shapiro, M.: Optimistic replication. ACM Computing Surveys 37(1), 42–81 (2005)CrossRefGoogle Scholar","Salas, J., Perez-Sorrosal, F., Martínez, M.P., Jiménez-Peris, R.: WS-Replication: a framework for highly available web services. In: Proc. of the 15th International Conference on World Wide Web, Edinburgh, Scotland, pp. 357–366 (May 2006)","Zheng, W.: Linux virtual server for scalable network services. In: Proceedings of the Linux Symposium, Ottawa (2000)"]