["Astrahan, M.M., et al.: A history and evaluation of System R. Communications of the ACM 24, 632–646 (1981)CrossRefGoogle Scholar","Bernstein, P.A., Hadzilacos, V., Goodman, N.: Concurrency control and recovery in database systems. Addison-Wesley Longman Publishing, Boston (1987)Google Scholar","Cabrera, L.F., et al.: Web Services Atomic Transaction (WS-AtomicTransaction). Version 1.0, IBM developerWorks (2005)","Castro, P., Nori, A.A.: A Programming Model for Data on the Web. Data Engineering, 2008. In: IEEE 24th International Conference on Data Engineering. ICDE 2008, pp. 1556–1559 (2008)","Crockford, D.: JSON: The fat-free alternative to XML. In: Proc. of XML 2006 (2006)","Date, C.J.: An Introduction to Database Systems, 5th edn. Addison-Wesley, Reading (1996)MATHGoogle Scholar","Fielding, R.T.: Architectural Styles and the Design of Network-based Software Architectures. University of California, Irvine (2000)","Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Berners-Lee, T.: Hypertext Transfer Protocol–HTTP/1.1. RFC 2616, The Internet Engineering Task Force (1999)","Gray, J.: Benchmark Handbook: For Database and Transaction Processing Systems. Morgan Kaufmann Publishers Inc., San Francisco (1992)MATHGoogle Scholar","Gray, J., Reuter, A.: Transaction Processing: Concepts and Techniques. Morgan Kaufmann Publishers Inc., San Francisco (1993)MATHGoogle Scholar","Greenberg, S., Marwood, D.: Real time groupware as a distributed system: concurrency control and its effect on the interface. In: Proceedings of the 1994 ACM conference on Computer supported cooperative work, pp. 207–217 (1994)","Hadley, M., Sandoz, P.: JSR 311: Java api for RESTful web services. Technical report, Java Community Process, Sun Microsystems (2007)","Hoffman, P., Bray, T.: Atom Publishing Format and Protocol (atompub). In: IETF (2006)","Khare, R., Taylor, R.N.: Extending the Representational State Transfer (REST) Architectural Style for Decentralized Systems. In: Proc. of the 26th International Conf. on Software Engineering, vol. 23, pp. 428–437 (2004)","McGuffin, L.J., Olson, G.M.: ShrEdit: A Shared Electronic Work Space. University of Michigan, Cognitive Science and Machine Intelligence Laboratory (1992)","Ramakrishnan, R., Gehrke, J.: Database Management Systems. McGraw-Hill Science/Engineering/Math (2003)","Razavi, A., Moschoyiannis, S., Krause, P.: Concurrency Control and Recovery Management in Open e-Business Transactions. In: Proc. WoTUG (CPA 2007), pp. 267–285 (2007)","Richardson, L., Ruby, S.: RESTful Web Services. O’Reilly Media, Inc., Sebastopol (2007)Google Scholar","Sun, C., Ellis, C.: Operational transformation in real-time group editors: issues, algorithms, and achievements. In: Proc. of the 1998 ACM conference on Computer supported cooperative work, pp. 59–68 (1998)","Vinoski, S.: WS-nonexistent standards. IEEE Internet Computing 8, 94–96 (2004)Google Scholar","Marinos, A., Razavi, A., Moschoyiannis, S., Krause, P.: RETRO: A Consistent and Recoverable RESTful Transaction Model. In: IEEE 7th International Conference on Web Services (ICWS 2009), Los Angeles, CA, USA (2009) (in the processe to be published)"]