["OMG: Business Process Model and Notation (BPMN), Version 2.0. http://www.omg.org/spec/BPMN/2.0/\n        ","Fielding, R.T.: Architectural Styles and the Design of Network-based Software Architectures. PhD thesis (2000)","Nikaj, A., Mandal, S., Pautasso, C., Weske, M.: From choreography diagrams to RESTful interactions. In: Service Oriented Applications, WESOA 2015, co-located with ICSOC 2015. Springer (2015)","Pautasso, C.: BPMN for REST. In: Dijkman, R., Hofstetter, J., Koehler, J. (eds.) BPMN 2011. LNBIP, vol. 95, pp. 74–87. Springer, Heidelberg (2011)CrossRefGoogle Scholar","Mendling, J., Reijers, H.A., Recker, J.: Activity labeling in process modeling: empirical insights and recommendations. Inf. Syst. 35(4), 467–482 (2010)CrossRefGoogle Scholar","Leopold, H., Eid-Sabbagh, R., Mendling, J., Azevedo, L.G., Baião, F.A.: Detection of naming convention violations in process models for different languages. Decis. Support Syst. 56, 310–325 (2013)CrossRefGoogle Scholar","Miller, G.A.: WordNet: a lexical database for English. Commun. ACM 38(11), 39–41 (1995)CrossRefGoogle Scholar","Wu, Z., Palmer, M.: Verbs semantics and lexical selection. In: Proceedings of the 32nd Annual Meeting on Association for Computational Linguistics, pp. 133–138 (1994)","Resnik, P.: Using information content to evaluate semantic similarity in a taxonomy. In: Proceedings of the 14th International Joint Conference on Artificial Intelligence, pp. 448–453 (1995)","Lin, D.: An information-theoretic definition of similarity. In: ICML, vol. 98, pp. 296–304 (1998)","Kolb, P.: Disco: a multilingual database of distributionally similar words. In: Proceedings of KONVENS 2008, Berlin (2008)","Kolb, P.: Experiments on the difference between semantic similarity and relatedness. In: Proceedings of the 17th Nordic Conference on Computational Linguistics (2009)","Reiter, E., Dale, R.: Building applied natural language generation systems. Nat. Lang. Eng. 3(1), 57–87 (1997)CrossRefGoogle Scholar","Denger, C., Berry, D.M., Kamsties, E.: Higher quality requirements specifications through natural language patterns. In: 2003 IEEE International Conference on Software - Science, Technology and Engineering, pp. 80–90 (2003)","Leopold, H., Mendling, J., Polyvyanyy, A.: Generating natural language texts from business process models. In: Ralyté, J., Franch, X., Brinkkemper, S., Wrycza, S. (eds.) CAiSE 2012. LNCS, vol. 7328, pp. 64–79. Springer, Heidelberg (2012)CrossRefGoogle Scholar","Leopold, H., Mendling, J., Polyvyanyy, A.: Supporting process model validation through natural language generation. IEEE Trans. Softw. Eng. 40(8), 818–840 (2014)CrossRefGoogle Scholar","Knöpfel, A., Gröne, B., Tabeling, P.: Fundamental modeling concepts. Effective Communication of IT Systems, England (2005)","Palma, F., Gonzalez-Huerta, J., Moha, N., Guéhéneuc, Y.-G., Tremblay, G.: Are RESTful APIs well-designed? detection of their linguistic (Anti)patterns. In: Barros, A., Grigori, D., Narendra, N.C., Dam, H.K. (eds.) ICSOC 2015. LNCS, vol. 9435, pp. 171–187. Springer, Heidelberg (2015). doi:10.1007/978-3-662-48616-0_11\n        CrossRefGoogle Scholar","Valverde, F., Pastor, O.: Dealing with rest services in model-driven web engineering methods. In: V Jornadas Científico-Técnicas en Servicios Web y SOA, JSWEB (2009)","Schreier, S.: Modeling restful applications. In: Proceedings of the Second International Workshop on RESTful Design, pp. 15–21. ACM (2011)","Laitkorpi, M., Selonen, P.: Towards a model-driven process for designing restful web services. In: IEEE International Conference on Web Services, pp. 173–180. IEEE (2009)","Decker, G., Kopp, O., Leymann, F., Weske, M.: Bpel4chor: extending BPEL for modeling choreographies. In: IEEE International Conference on Web Services 2007, pp. 296–303 (2007)","Jordan, D., Evdemon, J., Alves, A., Arkin, A., Askary, S., Barreto, C., Bloch, B., Curbera, F., Ford, M., Goland, Y., et al.: Web services business process execution language version 2.0. OASIS Standard 11, 1–10 (2007)Google Scholar","Alonso, G., Casati, F., Kuno, H., Machiraju, V.: Web Services. Data-Centric Systems and Applications. Springer, Heidelberg (2004)CrossRefGoogle Scholar"]