["Erl, T.: SOA Principles of Service Design (The Prentice Hall Service-Oriented Computing Series from Thomas Erl). Prentice Hall PTR, Upper Saddle River (2007)Google Scholar","Gudgin, M., Hadley, M., Mendelsohn, N., Moreau, J.-J., Nielsen, H.F., Karmarkar, A., Lafon, Y.: SOAP Version 1.2 Part 1: Messaging Framework, 2nd edn. W3C Recommendation, W3C (2007)","Fielding, R.: Architectural Styles and the Design of Network-based Software Architectures. PhD thesis, University of California, Irvine (2000)","Wilde, E., Pautasso, C. (eds.): REST: From Research to Practice. Springer (2011)","Chinnici, R., Moreau, J.-J., Ryman, A., Weerawarana, S.: Web Services Description Language (WSDL) Version 2.0 Part 1: Core Language. W3C Recommendation, W3C (2007)","Clement, L., Hately, A., von Riegen, C., Rogers, T.: UDDI Version 3.0.2. Organization for the Advancement of Structured Information Standards, UDDI Spec Technical Committee Draft (2004)","Pautasso, C., Wilde, E.: Why is the web loosely coupled?: A multi-faceted metric for service design. In: Proceedings of the 18th International Conference on World Wide Web (WWW). ACM (2009)","Amundsen, M.: Hold Your Nose vs. Follow Your Nose, Observations on the state of service description on the Web. In: 5th International Workshop on Web APIs and RESTful Design, WS-REST (2014)","MuleSoft, Inc., RAML Version 0.8: RESTful API Modeling Language. Tech. rep. (2013)","Bennara, M., Mrissa, M., Amghar, Y.: An Approach for Composing RESTful Linked Services on the Web. In: 5th International Workshop on Web APIs and RESTful Design, WS-REST (2014)","Verborgh, R., Steiner, T., Van Deursen, D., De Roo, J., Van de Walle, R., Gabarró Vallés, J.: Description and Interaction of RESTful Services for Automatic Discovery and Execution. In: Proceedings of the FTRA 2011 International Workshop on Advanced Future Multimedia Services, AFMS (2011)","Gregorio, J., Fielding, R., Hadley, M., Nottingham, M., Orchard, D.: URI Template. RFC 6570, IETF (2012)","Gorski, P., Lo Iacono, L., Nguyen, H.V., Torkian, D.B.: Service Security Revisited. In: 11th IEEE International Conference on Services Computing, SCC (2014)"]